incompressible/pimpleFoam/LES/offshorewindpark/constant/NREL6MW_Blade/NREL6MW_17_elementProfiles
// Blade element profiles for NREL6MW with 17 actuator points
circular050	//1
circular050	//2
circular035	//3
DU99W405LM	//4
DU99W350LM	//5
DU99W350LM	//6
DU97W300LM	//7
DU91W2250LM	//8
DU91W2250LM	//9
DU93W210LM	//10
DU93W210LM	//11
NACA64618	//12
NACA64618	//13
NACA64618	//14
NACA64618	//15
NACA64618	//16
NACA64618	//17

