incompressible/pimpleFoam/LES/offshorewindpark/constant/NREL6MW_foil/DU35_A17
//DU35 airfoil with an aspect ratio of 17.  Original -180 to 180deg Cl, Cd, and Cm versus AOA data taken from Appendix A of DOWEC document 10046_009.pdf (numerical values obtained from Koert Lindenburg of ECN).
//Cl and Cd values corrected for rotational stall delay and Cd values corrected using the Viterna method for 0 to 90deg AOA by Jason Jonkman using AirfoilPrep_v2p0.xls.				
//	AOA	Cl	Cd	
(	-180	0	0.0407	)
(	-175	0.223	0.0507	)
(	-170	0.405	0.1055	)
(	-160	0.658	0.2982	)
(	-155	0.733	0.4121	)
(	-150	0.778	0.5308	)
(	-145	0.795	0.6503	)
(	-140	0.787	0.7672	)
(	-135	0.757	0.8785	)
(	-130	0.708	0.9819	)
(	-125	0.641	1.0756	)
(	-120	0.56	1.158	)
(	-115	0.467	1.228	)
(	-110	0.365	1.2847	)
(	-105	0.255	1.3274	)
(	-100	0.139	1.3557	)
(	-95	0.021	1.3692	)
(	-90	-0.098	1.368	)
(	-85	-0.216	1.3521	)
(	-80	-0.331	1.3218	)
(	-75	-0.441	1.2773	)
(	-70	-0.544	1.2193	)
(	-65	-0.638	1.1486	)
(	-60	-0.72	1.066	)
(	-55	-0.788	0.9728	)
(	-50	-0.84	0.8705	)
(	-45	-0.875	0.7611	)
(	-40	-0.889	0.6466	)
(	-35	-0.88	0.5299	)
(	-30	-0.846	0.4141	)
(	-25	-0.784	0.303	)
(	-24	-0.768	0.2817	)
(	-23	-0.751	0.2608	)
(	-22	-0.733	0.2404	)
(	-21	-0.714	0.2205	)
(	-20	-0.693	0.2011	)
(	-19	-0.671	0.1822	)
(	-18	-0.648	0.164	)
(	-17	-0.624	0.1465	)
(	-16	-0.601	0.13	)
(	-15	-0.579	0.1145	)
(	-14	-0.559	0.1	)
(	-13	-0.539	0.0867	)
(	-12	-0.519	0.0744	)
(	-11	-0.499	0.0633	)
(	-10	-0.48	0.0534	)
(	-5.54	-0.385	0.0245	)
(	-5.04	-0.359	0.0225	)
(	-4.54	-0.36	0.0196	)
(	-4.04	-0.355	0.0174	)
(	-3.54	-0.307	0.0162	)
(	-3.04	-0.246	0.0144	)
(	-3	-0.24	0.024	)
(	-2.5	-0.163	0.0188	)
(	-2	-0.091	0.016	)
(	-1.5	-0.019	0.0137	)
(	-1	0.052	0.0118	)
(	-0.5	0.121	0.0104	)
(	0	0.196	0.0094	)
(	0.5	0.265	0.0096	)
(	1	0.335	0.0098	)
(	1.5	0.404	0.0099	)
(	2	0.472	0.01	)
(	2.5	0.54	0.0102	)
(	3	0.608	0.0103	)
(	3.5	0.674	0.0104	)
(	4	0.742	0.0105	)
(	4.5	0.809	0.0107	)
(	5	0.875	0.0108	)
(	5.5	0.941	0.0109	)
(	6	1.007	0.011	)
(	6.5	1.071	0.0113	)
(	7	1.134	0.0115	)
(	7.5	1.198	0.0117	)
(	8	1.26	0.012	)
(	8.5	1.318	0.0126	)
(	9	1.368	0.0133	)
(	9.5	1.422	0.0143	)
(	10	1.475	0.0156	)
(	10.5	1.523	0.0174	)
(	11	1.57	0.0194	)
(	11.5	1.609	0.0227	)
(	12	1.642	0.0269	)
(	12.5	1.675	0.0319	)
(	13	1.7	0.0398	)
(	13.5	1.717	0.0488	)
(	14	1.712	0.0614	)
(	14.5	1.703	0.0786	)
(	15.5	1.671	0.1173	)
(	16	1.649	0.1377	)
(	16.5	1.621	0.16	)
(	17	1.598	0.1814	)
(	17.5	1.571	0.2042	)
(	18	1.549	0.2316	)
(	19	1.544	0.2719	)
(	19.5	1.549	0.2906	)
(	20	1.565	0.3085	)
(	21	1.565	0.3447	)
(	22	1.563	0.382	)
(	23	1.558	0.4203	)
(	24	1.552	0.4593	)
(	25	1.546	0.4988	)
(	26	1.539	0.5387	)
(	28	1.527	0.6187	)
(	30	1.522	0.6978	)
(	32	1.529	0.7747	)
(	35	1.544	0.8869	)
(	40	1.529	1.0671	)
(	45	1.471	1.2319	)
(	50	1.376	1.3747	)
(	55	1.249	1.4899	)
(	60	1.097	1.5728	)
(	65	0.928	1.6202	)
(	70	0.75	1.6302	)
(	75	0.57	1.6031	)
(	80	0.396	1.5423	)
(	85	0.237	1.4598	)
(	90	0.101	1.4041	)
(	95	-0.022	1.4053	)
(	100	-0.143	1.3914	)
(	105	-0.261	1.3625	)
(	110	-0.374	1.3188	)
(	115	-0.48	1.2608	)
(	120	-0.575	1.1891	)
(	125	-0.659	1.1046	)
(	130	-0.727	1.0086	)
(	135	-0.778	0.9025	)
(	140	-0.809	0.7883	)
(	145	-0.818	0.6684	)
(	150	-0.8	0.5457	)
(	155	-0.754	0.4236	)
(	160	-0.677	0.3066	)
(	170	-0.417	0.1085	)
(	175	-0.229	0.051	)
(	180	0	0.0407	)

