incompressible/pimpleFoam/LES/offshorewindpark/system/topoSetDict.refine3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {					
	name	refineH3;			
	type	cellSet;				
	action	new;				
	source	boxToCell;				
	box (305650 5.95800e+06 -1) (319510 5.97197e+06 1001);
   }					
);

// ************************************************************************* //
