incompressible/pimpleFoam/LES/offshorewindpark/system/writeRegisteredObject
writeRegisteredObject1
{
    enabled             false;
    type                writeObjects;
    libs                ("libutilityFunctionObjects.so");
    writeControl    	adjustableRunTime;
    writeInterval       10.0;
    objects             (U);
}
