incompressible/pimpleFoam/LES/offshorewindpark/Allpre
#!/bin/sh

### Script for preparing the grid for the offshore wind park simulation
### HLRS, 2022-2023

# This application has been developed as part of the exaFOAM project
# https://www.exafoam.eu, which has received funding from
# the European High-Performance Computing Joint Undertaking Joint
# Undertaking (JU) under grant agreement No 956416. The JU receives
# support from the European Union's Horizon 2020 research and
# innovation programme and France, United Kingdom, Germany, Italy,
# Croatia, Spain, Greece, Portugal


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

loopRefineMesh () {
	for SET in windTurbineA01 windTurbineA02 windTurbineA03 windTurbineA04 windTurbineA05 windTurbineA06 windTurbineA07 windTurbineB01 windTurbineB02 windTurbineB03 windTurbineB04 windTurbineB05 windTurbineB06 windTurbineB07 windTurbineC01 windTurbineC02 windTurbineC03 windTurbineC06 windTurbineC07 windTurbineD01 windTurbineD07 windTurbineE01 windTurbineE02 windTurbineE03 windTurbineE04 windTurbineE05 windTurbineE06 windTurbineE07 windTurbineF01 windTurbineF02 windTurbineF03 windTurbineF04 windTurbineF05 windTurbineF06 windTurbineF07 ; do
	sed -i "s/windTurbine[a-zA-Z0-9]*/${SET}/g" system/refineMeshDict.windturbines
	runApplication -s windturbine_${SET} refineMesh -overwrite -dict system/refineMeshDict.windturbines
        done
}


runApplication blockMesh
runApplication -s iter1 transformPoints -rollPitchYaw '(0 0 123.17)'
runApplication -s iter2 transformPoints -translate '( 319.5 5963.5 0)'
runApplication -s iter3 transformPoints -scale 1000
runApplication -s refine1 topoSet -dict system/topoSetDict.refine1
runApplication -s refine1 refineMesh -overwrite -dict system/refineMeshDict.refine1
runApplication -s refine2 topoSet -dict system/topoSetDict.refine2
runApplication -s refine2 refineMesh -overwrite -dict system/refineMeshDict.refine2
runApplication -s windturbines topoSet -dict system/topoSetDict.windturbines  
loopRefineMesh
runApplication -s refine3 topoSet -dict system/topoSetDict.refine3
runApplication -s refine3 refineMesh -overwrite -dict system/refineMeshDict.refine3
python createInletBoundaryData.py
