incompressible/pimpleFoam/LES/offshorewindpark/Allrun
#!/bin/sh

### Script for running the offshore wind park simulation in parallel
### HLRS, 2022-2023

# This application has been developed as part of the exaFOAM project
# https://www.exafoam.eu, which has received funding from
# the European High-Performance Computing Joint Undertaking Joint
# Undertaking (JU) under grant agreement No 956416. The JU receives
# support from the European Union's Horizon 2020 research and
# innovation programme and France, United Kingdom, Germany, Italy,
# Croatia, Spain, Greece, Portugal


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir

runApplication decomposePar
runParallel renumberMesh -overwrite 
runParallel pimpleFoam

# -----------------------------------------------------------------------------
